<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Lightwright (John McKernon Software) in a zip archive. Modified from Jazzace</string>
    <key>Identifier</key>
    <string>com.github.rareware.download.lightwright</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Lightwright</string>
        <key>DOWNLOAD_URL</key>
        <string>http://www.mckernon.com/downloads/LW5MacInstaller.zip</string>
	</dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>